#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation ✅`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app]
module.container-registry.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app/providers/Microsoft.ContainerRegistry/registries/acrsampleapp001]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-messaging-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-client-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-core-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-client-githubactions"]: Read complete after 1s [id=2fd74462-5a25-4371-b0e9-bef5a439f25e]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-messaging-githubactions"]: Read complete after 1s [id=ff75e804-3e39-4335-a603-cdd0ce98db4b]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-core-githubactions"]: Read complete after 1s [id=50284a0a-c2e6-484f-a5c1-26c1f612a774]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-core-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app/providers/Microsoft.ContainerRegistry/registries/acrsampleapp001/providers/Microsoft.Authorization/roleAssignments/9a798501-d218-67ed-aa41-4d61fdd34a18]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-client-githubactions"] will be created
  + resource "azurerm_role_assignment" "service_principals" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2fd74462-5a25-4371-b0e9-bef5a439f25e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app/providers/Microsoft.ContainerRegistry/registries/acrsampleapp001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-messaging-githubactions"] will be created
  + resource "azurerm_role_assignment" "service_principals" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff75e804-3e39-4335-a603-cdd0ce98db4b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app/providers/Microsoft.ContainerRegistry/registries/acrsampleapp001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*